# DataDictionaryDifferentInLink Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..DataDictionaryDifferentInLink Property
BuiltInFailures..::..LinkFailures Class See Also
---
Linked file [Name] was last saved in a previous version of Revit. Changes to it cannot be saved until it is upgraded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DataDictionaryDifferentInLink { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DataDictionaryDifferentInLink As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DataDictionaryDifferentInLink {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace